Revit 2026 API

# UpdaterRegistryIsUpdaterEnabled Method

---

Checks if the updater is enabled or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsUpdaterEnabled(
	UpdaterId id
)
```
```vb
Public Shared Function IsUpdaterEnabled (
	id As UpdaterId
) As Boolean
```
```cpp
public:
static bool IsUpdaterEnabled(
	UpdaterId^ id
)
```
```fsharp
static member IsUpdaterEnabled :
        id : UpdaterId -> bool
```

#### Parameters

id UpdaterId
     The updater id.

#### Return Value

Boolean Returns true if the updater is enabled, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | Updater with this Id is not currently registered in Revit. |
| ArgumentNullException | A non-optional argument was null |

Even when an updater is enabled it could still be suspended for misbehaving, in which case it would not be executed regardless of its enable/disable status.

#### Reference

UpdaterRegistry Class

Autodesk.Revit.DB Namespace